Test Data/Vultr/web-perf-pri1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.96.4 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        10.1.96.4
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   6.656 seconds
Complete requests:      10000
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Keep-Alive requests:    9896
Total transferred:      4202496 bytes
HTML transferred:       1149080 bytes
Requests per second:    1502.47 [#/sec] (mean)
Time per request:       66.557 [ms] (mean)
Time per request:       0.666 [ms] (mean, across all concurrent requests)
Transfer rate:          616.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     0   51 468.1      1    5777
Waiting:        0   47 447.2      1    5777
Total:          0   51 468.1      1    5777

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      4
  99%   1061
 100%   5777 (longest request)