Test Data/Vultr/web-perf-pri2.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.96.4 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        10.1.96.4
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   1.724 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9909
Total transferred:      4206074 bytes
HTML transferred:       1150000 bytes
Requests per second:    5799.46 [#/sec] (mean)
Time per request:       17.243 [ms] (mean)
Time per request:       0.172 [ms] (mean, across all concurrent requests)
Transfer rate:          2382.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0   14  27.8     13    1320
Waiting:        0   14  27.8     13    1320
Total:          0   14  27.8     13    1322

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     15
  90%     17
  95%     19
  98%     22
  99%     25
 100%   1322 (longest request)